---
layout: post
title: "About me"
description: "个人简历" 
header-img: "img/about-bg.jpg"
---

# 马强的个人简历

本文档由 markdown 文档自动转换生成

## 基本信息

- 姓名：马强

- 年龄： 33

- 毕业院校： 北京林业大学，统招大专

- 电话： 186####5109

- 邮箱： broqiang@qq.com

- 个人主页： [http://broqiang.com](http://broqiang.com)

- Github: [https://github.com/BroQiang](https://github.com/BroQiang)


## 专业技能

- Linux 

    熟练使用 CentOS 和 Ubuntu ， 可以熟练配置主流的服务及工具，包括但不仅仅： LNMP、Git、SVN、Node、Composer、Mysql、Oracle、Java等。

    即使是一个新服务或者工具，基本看官方文档就可以部署（包括二进制安装，apt或yum安装，编码编译安装）

    熟练 shell 脚本，自己编写过LNMP自动安装脚本，Oracle RAC 静默安装脚本，项目自动发布、备份等脚本。基于 openwrt 开发云AP控制系统

    熟练在 Linux 下开发，个人现在的开发环境是 Ubuntu16.04

- PHP

    熟练使用面向对象编程，钟爱 OOP 思想

    了解主流设计模式，如工厂、单例（使用较多），适配器、装饰器等（不常用）

    熟练使用 Composer 自动加载，基于 Composer 开发过简单 OOP 框架

    熟练使用 ThinkPHP3 版本的框架，度过大约 50% 的源码

    熟练使用 Laravle 框架，读过大约 10% 的源码

- 数据库

    熟练安装及配置 Mysql，包括一些优化，主从同步等。

    熟练安装配置 Oracle，包括 Oracle RAC 环境（最后接触版本是11g），有 Oracle OCP 认证（已过期……）

- 前端

    css，可以写简单的

    熟练js，jquery，bootstrap，可以基于这几种技术快速开发项目


- 版本控制工具

    SVN 可以熟练配置服务器端及客户端，可以通过钩子和shell，做自动发布、同步等

    Git 熟练使用（客户端是在Linux下），可以独立配置私有的Git服务器，基于 Gogs （Go语言），熟悉 Github

- markdown

    熟练使用 markdown 编写文档，基本日常写文都是通过 markdown

- 微信

    熟悉微信接口的使用，熟悉 EasyWechat 微信框架

- Hadoop 

    做过 Hadoop 运维，配置过 基于 Hadoop2.4版本的集群环境

- 虚拟化

    做过虚拟化环境运维，熟练安装及配置 VMWare Vsphere （了解Esxi6.0之前版本）和 VMWare Workstation

    熟悉 KVM，可以安装及简单应用

- 熟悉机房环境主流的服务器，交换机，存储等设备，负载均衡设备等，并可以安装上架及配置 （几年前的，最近几年没接触）

- Java 

    可以看懂代码，写简单的 Java web 项目（几年前做过Java开发）

- 开发工具

    熟练使用 Sublime，熟悉 Atom、PHPStomr、Eclipse


## 项目经验

参与过多个项目

- 参与过电力的应急指挥系统、营销系统、输电系统、生产管理系统等多个项目

    主要环境是 F5 + Weblogic + Java + Oracle

- 参与过教委的多个项目，考试院首页、高考成绩查询、小升初、体检系统等

    项目环境比较复杂 涉及到的环境， LAMP、LNMP、Java等，服务器环境有实体机 和 VMWare虚拟化

    上面的项目时间有点久，具体已经记的不是很清楚了，主要负责的是运维工作

- 医院的免费WIFI系统

    此项目日最高并发大约是 20000

    * 客户端是 Openwrt 系统的定制 AP

        客户端3.0版本以前独立开发，通过 shell 控制 AP的升级，上报数据，启用停止，广告插入等，后续版本升级为用 C 开发（和一个C的同事合作开发）

    * 云端主要是 LNMP 环境

        负责全部环境的搭建 硬件（机房服务、存储、光纤交换机等）安装，软件（包括虚拟化，操作系统，LNMP，负载均衡等）

        参与云平台部分代码开发，主要是接口部分，和Wifi交互及和医院系统对接

    * 独立完成了监控系统，可以监控所有医院的中控服务器，PHP+Shell

- 多个内部使用系统

    包括：招生管理系统、答题系统、财务、HR、文档手册、问答、资产等并发量不高的内部使用的小系统 
    
- 微信公众号项目（做过2个）
    
    * 用于推广的一个项目（各种活动，包括自动生成海报、发红包、投票、答题等）

    * 上网卡充值的微商项目，主要是通过微信支付，调用电信的接口对上网卡进行控制

## 工作经历

- 2016/03 -- 

    * 公司： 北京育知同创科技有限公司

    * 职位： php主管

    * 薪资： 15k

    * 主要工作： 
     
        维护公司服务器，配合运营做网站及项目，配合其他部门做内部系统的开发

        培训并带领下属同事做项目（1个前端开发、2个PHP开发）

- 2015/03 -- 2016/02

    * 公司： 维斯盾网络科技有限公司

    * 职位： 研发工程师

    * 薪资： 18k

    * 主要工作： 
     
        公司服务器维护，AP开发，系统开发

- 2013/07 -- 2015/03

    * 公司： 华商电力科技中心

    * 职位： 工程师（项目部）

    * 薪资： 12k

    * 主要工作： 
     
        电力的三产，主要负责电力的各种系统

- 2012/03 -- 2013/06

    * 公司： 北京盛学成长科技有限公司

    * 职位： 运维开发工程师

    * 薪资： 9k

    * 主要工作： 
     
        主要负责教委、教育学院、考试院等机构相关的系统开发及维护

- 2006/01 -- 2012/01

    * 公司： 外包公司
    
    * 职位： 多个

    * 薪资： 1800-4500 （刚进去的时候是1800，到辞职的时候是4500）
    
    * 主要工作：
        
        这个阶段做过的工作很多，围绕着电力去过多个项目，工种也被外包安装更换过多种，最后电力的三产将整个项目组合并

        在电力的多个电力公司，供电所，中国电科院，国网电科院（南京总部出差过半年，北京办事处待过），国网信通等待过

        做过 Java开发、技术支持、机房建设及运维、专门的服务器运维等工作。还有就是经常开会……

## 职业目标

开发对于我来说，既是一份工作也是兴趣，能够开发出属于自己的产品，并开源

未来成为一个在社区很出名的全栈技术 "大牛"











